; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=7, locations=10, density=1.0, fully_connected=True, max_capacity=2, out_folder=./full/training, instance_id=45, seed=86

(define (problem transport-45)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l9)
    (at p2 l5)
    (at p3 l7)
    (at p4 l2)
    (at p5 l9)
    (at p6 l2)
    (at p7 l7)
    (at v1 l8)
    (at v2 l1)
    (at v3 l10)
    (at v4 l4)
    )
 (:goal  (and 
    (at p1 l4)
    (at p2 l6)
    (at p3 l1)
    (at p4 l3)
    (at p5 l7)
    (at p6 l5)
    (at p7 l2))))

; plan
1. (drive v2 l1 l9)
   deleted: (at v2 l1)
   added: (at v2 l9)
   goals met: 0 of 7
2. (pick-up v2 l9 p1 c1 c2)
   deleted: (at p1 l9) (capacity v2 c2)
   added: (in p1 v2) (capacity v2 c1)
   goals met: 0 of 7
3. (pick-up v2 l9 p5 c0 c1)
   deleted: (at p5 l9) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 0 of 7
4. (drive v2 l9 l4)
   deleted: (at v2 l9)
   added: (at v2 l4)
   goals met: 0 of 7
5. (drop v2 l4 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l4) (capacity v2 c1)
   goals met: 1 of 7
6. (drive v2 l4 l7)
   deleted: (at v2 l4)
   added: (at v2 l7)
   goals met: 1 of 7
7. (pick-up v2 l7 p3 c0 c1)
   deleted: (at p3 l7) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 1 of 7
8. (drop v2 l7 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l7) (capacity v2 c1)
   goals met: 2 of 7
9. (pick-up v2 l7 p7 c0 c1)
   deleted: (at p7 l7) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 2 of 7
10. (drive v2 l7 l1)
   deleted: (at v2 l7)
   added: (at v2 l1)
   goals met: 2 of 7
11. (drop v2 l1 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l1) (capacity v2 c1)
   goals met: 3 of 7
12. (drive v2 l1 l2)
   deleted: (at v2 l1)
   added: (at v2 l2)
   goals met: 3 of 7
13. (pick-up v2 l2 p4 c0 c1)
   deleted: (at p4 l2) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 3 of 7
14. (drop v2 l2 p7 c0 c1)
   deleted: (in p7 v2) (capacity v2 c0)
   added: (at p7 l2) (capacity v2 c1)
   goals met: 4 of 7
15. (pick-up v2 l2 p6 c0 c1)
   deleted: (at p6 l2) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 4 of 7
16. (drive v2 l2 l3)
   deleted: (at v2 l2)
   added: (at v2 l3)
   goals met: 4 of 7
17. (drop v2 l3 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l3) (capacity v2 c1)
   goals met: 5 of 7
18. (drive v2 l3 l5)
   deleted: (at v2 l3)
   added: (at v2 l5)
   goals met: 5 of 7
19. (pick-up v2 l5 p2 c0 c1)
   deleted: (at p2 l5) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 5 of 7
20. (drop v2 l5 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l5) (capacity v2 c1)
   goals met: 6 of 7
21. (drive v2 l5 l6)
   deleted: (at v2 l5)
   added: (at v2 l6)
   goals met: 6 of 7
22. (drop v2 l6 p2 c1 c2)
   deleted: (in p2 v2) (capacity v2 c1)
   added: (at p2 l6) (capacity v2 c2)
   goals met: 7 of 7
